[{"bdu": "BDU:2024-09589", "desc": "Уязвимость удаленного выполнения кода службы телефонии Windows", "risk": "Критический"}, {"bdu": "BDU:2022-04039", "desc": "Уязвимость в OpenSSL 3.0.0, 3.0.1, 3.0.2, 3.0.3, 1.1.1 до 1.1.1o, и 1.0.2 до 1.0.2ze позволяет злоумышленнику выполнить произвольные команды.", "risk": "Критический"}, {"bdu": "BDU:2024-09602", "desc": "Уязвимость удаленного выполнения кода службы телефонии Windows", "risk": "Критический"}, {"bdu": "BDU:2024-07377", "desc": "Была обнаружена проблема в libexpat до версии 2.6.3. dtdCopy в xmlparse.c может иметь целочисленное переполнение для nDefaultAtts на 32-разрядных платформах (где UINT_MAX равен SIZE_MAX).", "risk": "Критический"}, {"bdu": "BDU:2024-07376", "desc": "В libexpat до версии 2.6.3 обнаружена проблема. nextScaffoldPart в xmlparse.c может иметь целочисленное переполнение для m_groupSize на 32-разрядных платформах (где UINT_MAX равен SIZE_MAX).", "risk": "Критический"}, {"bdu": "BDU:2022-06445", "desc": "Реализация эталона Keccak XKCP SHA-3 до fdc6fef имеет целочисленное переполнение и результирующее переполнение буфера, что позволяет злоумышленникам выполнять произвольный код или устранять ожидаемые криптографические свойства. Это происходит в интерфейсе функции губки.", "risk": "Критический"}, {"bdu": "BDU:2021-01781", "desc": "Уязвимость в Python 3.x по 3.9.1 (CVE-2021-3177)", "risk": "Критический"}, {"bdu": "BDU:2024-09591", "desc": "Уязвимость удаленного выполнения кода службы телефонии Windows", "risk": "Критический"}, {"bdu": "BDU:2024-09594", "desc": "Уязвимость удаленного выполнения кода службы телефонии Windows", "risk": "Критический"}, {"bdu": "BDU:2024-09595", "desc": "Уязвимость удаленного выполнения кода службы телефонии Windows", "risk": "Критический"}, {"bdu": "BDU:2024-07004", "desc": "В libexpat до версии 2.6.3 обнаружена проблема. xmlparse.c не отклоняет отрицательную длину для XML_ParseBuffer.", "risk": "Критический"}, {"bdu": "BDU:2024-07004", "desc": "В libexpat до версии 2.6.3 обнаружена проблема. xmlparse.c не отклоняет отрицательную длину для XML_ParseBuffer.", "risk": "Критический"}, {"bdu": "BDU:2024-07377", "desc": "Была обнаружена проблема в libexpat до версии 2.6.3. dtdCopy в xmlparse.c может иметь целочисленное переполнение для nDefaultAtts на 32-разрядных платформах (где UINT_MAX равен SIZE_MAX).", "risk": "Критический"}, {"bdu": "BDU:2024-07376", "desc": "В libexpat до версии 2.6.3 обнаружена проблема. nextScaffoldPart в xmlparse.c может иметь целочисленное переполнение для m_groupSize на 32-разрядных платформах (где UINT_MAX равен SIZE_MAX).", "risk": "Критический"}, {"bdu": "BDU:2024-09609", "desc": "Уязвимость удаленного выполнения кода службы телефонии Windows", "risk": "Критический"}, {"bdu": "BDU:2022-03962", "desc": "Уязвимость в Python по 3.10.4 (CVE-2015-20107)", "risk": "Критический"}, {"bdu": "BDU:2024-05176", "desc": "Уязвимость в OpenSSL 3.3.0 до 3.3.1, 3.2.0 до 3.2.2, 3.1.0 до 3.1.6, 3.0.0 до 3.0.14, и 1.1.1 до 1.1.1y.", "risk": "Высокий"}, {"bdu": "BDU:2023-02240", "desc": "Уязвимость двойного освобождения в OpenSSL 3.0.0 до 3.0.8, и 1.1.1 до 1.1.1t может привести к падению приложения.", "risk": "Высокий"}, {"bdu": "BDU:2023-02108", "desc": "Уязвимость в OpenSSL 3.1.0 до 3.1.1, 3.0.0 до 3.0.9, и 1.1.1 до 1.1.1u, и 1.0.2 до 1.0.2zh, связанная с проверкой X.509 cертификата, позволяет вызвать отказ в обслуживании (DoS) через злонамеренный сертификат.", "risk": "Высокий"}, {"bdu": "BDU:2020-05230", "desc": "Уязвимость, приводящая к раскрытию информации WebP Image Extensions.", "risk": "Высокий"}, {"bdu": "BDU:2023-00665", "desc": "Уязвимость, связанная с подменой типа в OpenSSL 3.0.0 до 3.0.8, и 1.1.1 до 1.1.1t при обработке X.509 GeneralName может позволить злоумышленнику передать произвольные указатели на вызов memcmp и прочитать содержимое памяти или вызвать отказ в обслуживании.", "risk": "Высокий"}, {"bdu": "BDU:2023-00675", "desc": "Уязвимость использования памяти после освобождения в OpenSSL 3.0.0 до 3.0.8, и 1.1.1 до 1.1.1t может привести к падению приложения.", "risk": "Высокий"}, {"bdu": "BDU:2024-06988", "desc": "Уязвимость в OpenSSL в API функции SSL_select_next_proto.", "risk": "Высокий"}, {"bdu": "BDU:2023-03652", "desc": "Уязвимость в OpenSSL 3.1.1 до 3.1.1, 3.0.0 до 3.0.9, и 1.1.1 до 1.1.1u.", "risk": "Высокий"}, {"bdu": "BDU:2023-04977", "desc": "Уязвимость в Python по 3.11.4 позволяет удалённым злоумышленникам вызвать \"RecursionError: maximum recursion depth exceeded while calling Python object\" через специально сформированный аргумент.", "risk": "Высокий"}, {"bdu": "BDU:2022-01315", "desc": "Уязвимость в BN_mod_sqrt() функции OpenSSL 3.0.0, 3.0.1, и 1.1.1 до 1.1.1m может привести к бесконечному циклу.", "risk": "Высокий"}, {"bdu": "BDU:2023-05002", "desc": "Уязвимость в Python до 3.8.18, 3.9.x до 3.9.18, 3.10.x до 3.10.13, и 3.11.x до 3.11.5 при использовании TLS аутентификации клиента.", "risk": "Высокий"}, {"bdu": "BDU:2022-01339", "desc": "С тем, как функция WinVerifyTrust обрабатывает проверку подписи Authenticode в Windows для переносимых исполняемых (PE) файлов, связано существование уязвимости, делающей возможным удаленное выполнение кода. Анонимный злоумышленник может воспользоваться этой уязвимостью, изменив существующий подписанный переносимый исполняемый (PE) файл для обработки непроверенных частей файла. В результате в файл может быть добавлен вредоносный код без нарушения подлинности подписи. Воспользовавшись этой уязвимостью, злоумышленник может установить полный контроль над системой. После этого злоумышленник сможет устанавливать программы, просматривать, изменять и уничтожать данные или создавать новые учетные записи с неограниченными правами.", "risk": "Высокий"}, {"bdu": "BDU:2023-07691", "desc": "Уязвимость в OpenSSL 3.0.0 до 3.0.12, и 3.1.0 до 3.1.4.", "risk": "Высокий"}, {"bdu": "BDU:2024-08943", "desc": "Существует СРЕДНЯЯ степень серьезности уязвимости, влияющая на CPython. Регулярные выражения, которые допускают чрезмерный возврат во время разбора заголовка tarfile.TarFile, уязвимы к ReDoS через специально созданные архивы tar.", "risk": "Высокий"}, {"bdu": "BDU:2021-04571", "desc": "Уязвимость в OpenSSL 1.1.1 до 1.1.1k, и 1.0.2 до 1.0.2y может вызвать атаку \"Отказ в обслуживании\", а также привести к раскрытию содержимого памяти.", "risk": "Высокий"}, {"bdu": "BDU:2024-09604", "desc": "Уязвимость повышения привилегий в системном драйвере Windows USB Video Class", "risk": "Высокий"}, {"bdu": "BDU:2024-09597", "desc": "Уязвимость повышения привилегий в системном драйвере Windows USB Video Class", "risk": "Высокий"}, {"bdu": "BDU:2024-09692", "desc": "Уязвимость повышения привилегий в системном драйвере Windows USB Video Class", "risk": "Высокий"}, {"bdu": "BDU:2024-09487", "desc": "Уязвимость спуфинга раскрытия хэша NTLM", "risk": "Высокий"}, {"bdu": "BDU:2024-09607", "desc": "Уязвимость повышения привилегий общего виртуального диска Windows Hyper-V", "risk": "Высокий"}, {"bdu": "BDU:2024-08755", "desc": "Использование низкоуровневых API для эллиптических кривых GF(2^m) с недоверенными явными значениями полинома поля может привести к чтению или записи в память за пределами границ.", "risk": "Высокий"}, {"bdu": "BDU:2024-02120", "desc": "Была обнаружена проблема в классе CPython `tempfile.TemporaryDirectory`, влияющая на версии 3.12.1, 3.11.7, 3.10.13, 3.9.18 и 3.8.18 и более ранние. Класс tempfile.TemporaryDirectory разыменовывал символические ссылки во время очистки ошибок, связанных с разрешениями. Это означает, что пользователи, которые могут запускать привилегированные программы, потенциально могут изменять разрешения файлов, на которые ссылаются символические ссылки, в некоторых обстоятельствах.", "risk": "Высокий"}, {"bdu": "BDU:2023-00665", "desc": "Существует уязвимость путаницы типов, связанная с обработкой адресов X.400 внутри X.509 GeneralName. Адреса X.400 анализировались как ASN1_STRING, но определение публичной структуры для GENERAL_NAME неверно указывало тип поля x400Address как ASN1_TYPE. Это поле впоследствии интерпретируется функцией OpenSSL GENERAL_NAME_cmp как ASN1_TYPE, а не как ASN1_STRING.", "risk": "Высокий"}, {"bdu": "BDU:2023-03855", "desc": "Уязвимость в Python 3.11, 3.10, 3.9, 3.8, и 3.7 (CVE-2022-45061)", "risk": "Высокий"}, {"bdu": "BDU:2024-01976", "desc": "libexpat до версии 2.6.1 допускает атаку XML Entity Expansion при изолированном использовании внешних парсеров (созданных с помощью XML_ExternalEntityParserCreate).", "risk": "Высокий"}, {"bdu": "BDU:2022-06576", "desc": "Python 3.9.x до 3.9.16 и 3.10.x до 3.10.9 в Linux допускает локальное повышение привилегий в конфигурации, отличной от конфигурации по умолчанию. Библиотека многопроцессорной обработки Python при использовании с методом запуска forkserver в Linux позволяет десериализовать pickles от любого пользователя в локальном сетевом пространстве имен того же компьютера, что во многих системных конфигурациях означает любого пользователя на том же компьютере. Pickles могут выполнять произвольный код. Таким образом, это допускает локальное повышение привилегий пользователя до пользователя, от имени которого запущен любой процесс forkserver. Установка multiprocessing.util.abstract_sockets_supported в значение False является обходным путем. Метод запуска forkserver для многопроцессорной обработки не является методом запуска по умолчанию. Эта проблема характерна для Linux, поскольку только Linux поддерживает сокеты абстрактного пространства имен. CPython до версии 3.9 по умолчанию не использует сокеты абстрактного пространства имен Linux. Поддержка ручного указания пользователями сокета абстрактного пространства имен была добавлена ​​в качестве исправления ошибки в версиях 3.7.8 и 3.8.3, но для этого в CPython до версии 3.9 пользователям необходимо было выполнять особые необычные вызовы API.", "risk": "Высокий"}, {"bdu": "BDU:2024-08943", "desc": "Уязвимость в CPython (aka Python) до 3.13.0-rc1 (CVE-2024-6232)", "risk": "Высокий"}, {"bdu": "BDU:2024-08618", "desc": "Существует уязвимость LOW-критичности, затрагивающая CPython, в частности, модуль стандартной библиотеки 'http.cookies'. При разборе файлов cookie, содержащих обратные косые черты для символов в кавычках в значении файла cookie, анализатор будет использовать алгоритм с квадратичной сложностью, что приведет к использованию избыточных ресурсов ЦП при разборе значения.", "risk": "Высокий"}, {"bdu": "BDU:2024-01514", "desc": "libexpat до версии 2.5.0 допускает отказ в обслуживании (потребление ресурсов), поскольку в случае большого токена, для которого требуется несколько заполнений буфера, требуется много полных повторных анализов.", "risk": "Высокий"}, {"bdu": "BDU:2024-09598", "desc": "Уязвимость повышения привилегий в системном драйвере Windows USB Video Class", "risk": "Высокий"}, {"bdu": "BDU:2023-02688", "desc": "В libexpat до версии 2.4.9 существует проблема использования после освобождения памяти, вызванная чрезмерным уничтожением общего DTD в XML_ExternalEntityParserCreate в ситуациях нехватки памяти.", "risk": "Высокий"}, {"bdu": "BDU:2019-02881", "desc": "BZ2_decompress в decompress.c в bzip2 по 1.0.6 имеет выход за пределы выделенной памяти при наличии большого количества селекторов.", "risk": "Высокий"}, {"bdu": "BDU:2022-03181", "desc": "Уязвимость ввода команд в OpenSSL 3.0.0, 3.0.1, 3.0.2, 1.1.1 до 1.1.1n в c_rehash скрипте позволяет злоумышленнику выполнить произвольные команды.", "risk": "Высокий"}, {"bdu": "BDU:2024-09698", "desc": "Уязвимость Windows SMB, приводящая к отказу в обслуживании", "risk": "Высокий"}, {"bdu": "BDU:2024-09694", "desc": "Уязвимость повышения привилегий в системном драйвере Windows USB Video Class", "risk": "Высокий"}, {"bdu": "BDU:2024-08618", "desc": "Существует уязвимость LOW-критичности, затрагивающая CPython, в частности, модуль стандартной библиотеки 'http.cookies'. При разборе файлов cookie, содержащих обратные косые черты для символов в кавычках в значении файла cookie, анализатор будет использовать алгоритм с квадратичной сложностью, что приведет к использованию избыточных ресурсов ЦП при разборе значения.", "risk": "Высокий"}, {"bdu": "BDU:2023-02108", "desc": "Во всех поддерживаемых версиях OpenSSL обнаружена уязвимость безопасности, связанная с проверкой цепочек сертификатов X.509, включающих ограничения политики. Злоумышленники могут воспользоваться этой уязвимостью, создав вредоносную цепочку сертификатов, которая запускает экспоненциальное использование вычислительных ресурсов, что приводит к атаке типа «отказ в обслуживании» (DoS) на уязвимые системы. Обработка политик отключена по умолчанию, но ее можно включить, передав аргумент `-policy' утилитам командной строки или вызвав функцию X509_VERIFY_PARAM_set1_policies().", "risk": "Высокий"}, {"bdu": "BDU:2022-01315", "desc": "Функция BN_mod_sqrt(), которая вычисляет модульный квадратный корень, содержит ошибку, которая может привести к тому, что она будет зацикливаться вечно для непростых модулей. Внутри себя эта функция используется при разборе сертификатов, содержащих открытые ключи эллиптической кривой в сжатой форме или явные параметры эллиптической кривой с базовой точкой, закодированной в сжатой форме. Можно запустить бесконечный цикл, создав сертификат с недопустимыми явными параметрами кривой. Поскольку разбор сертификата происходит до проверки подписи сертификата, любой процесс, который анализирует внешний сертификат, может, таким образом, подвергнуться атаке типа «отказ в обслуживании». Бесконечный цикл также может быть достигнут при разборе созданных закрытых ключей, поскольку они могут содержать явные параметры эллиптической кривой. Таким образом, уязвимые ситуации включают: - TLS-клиенты, использующие сертификаты сервера - TLS-серверы, использующие клиентские сертификаты - Хостинг-провайдеры, принимающие сертификаты или закрытые ключи от клиентов - Центры сертификации, анализирующие запросы на сертификацию от подписчиков - Все остальное, что анализирует параметры эллиптической кривой ASN.1 Также любые другие приложения, использующие BN_mod_sqrt(), где злоумышленник может контролировать значения параметров, уязвимы к этой проблеме DoS. В версии OpenSSL 1.0.2 открытый ключ не анализируется во время первоначального анализа сертификата, что немного затрудняет запуск бесконечного цикла. Однако любая операция, требующая открытого ключа из сертификата, вызовет бесконечный цикл. В частности, злоумышленник может использовать самоподписанный сертификат для запуска цикла во время проверки подписи сертификата. Эта проблема затрагивает версии OpenSSL 1.0.2, 1.1.1 и 3.0. Проблема была устранена в выпусках 1.1.1n и 3.0.2 от 15 марта 2022 г. Исправлено в OpenSSL 3.0.2 (затронуто 3.0.0,3.0.1). Исправлено в OpenSSL 1.1.1n (затронуто 1.1.1-1.1.1m). Исправлено в OpenSSL 1.0.2zd (затронуто 1.0.2-1.0.2zc).", "risk": "Высокий"}, {"bdu": "BDU:2023-02596", "desc": "В libexpat до версии 2.4.9 в функции doContent в xmlparse.c есть use-after-free.", "risk": "Высокий"}, {"bdu": "BDU:2023-05002", "desc": "Уязвимость в Python 3.11, 3.10, 3.9, 3.8, и 3.7 (CVE-2023-40217)", "risk": "Высокий"}, {"bdu": "BDU:2023-04978", "desc": "Уязвимость в Python 3.11, 3.10, 3.9, 3.8, и 3.7 (CVE-2023-24329)", "risk": "Высокий"}, {"bdu": "BDU:2024-09603", "desc": "Уязвимость реестра Windows, приводящая к повышению привилегий", "risk": "Высокий"}, {"bdu": "BDU:2024-01976", "desc": "libexpat до версии 2.6.1 допускает атаку XML Entity Expansion при изолированном использовании внешних парсеров (созданных с помощью XML_ExternalEntityParserCreate).", "risk": "Высокий"}, {"bdu": "BDU:2016-00218", "desc": "Microsoft Internet Explorer 7 по 11 и Microsoft Edge позволяет удалённым злоумышленникам обойти защитный ASLR механизм через специально сформированный веб-сайт.", "risk": "Средний"}, {"bdu": "BDU:2023-02445", "desc": "Уязвимость отказа в обслуживании в pip пакете setuptools до 65.5.1.", "risk": "Средний"}, {"bdu": "BDU:2023-02237", "desc": "Уязвимость в OpenSSL 3.0.0 до 3.0.8, и 1.1.1 до 1.1.1t в реализации OpenSSL RSA Decryption может привести к восстановлению открытого текста по сети.", "risk": "Средний"}, {"bdu": "BDU:2024-04423", "desc": "В OpenSSL 3.0.0 до 3.0.14, 3.1.0 до 3.1.6, 3.2.0 до 3.2.2, и 3.3.0 до 3.3.1 проверка чрезмерно длинных ключей или параметров DSA может выполняться очень медленно.", "risk": "Средний"}, {"bdu": "BDU:2023-04960", "desc": "Уязвимость в OpenSSL 3.1.0 до 3.1.2, 3.0.0 до 3.0.10, и 1.1.1 до 1.1.1v может привести к отказу в обслуживании из-за проверки чрезмерно длинных ключей DH или параметров.", "risk": "Средний"}, {"bdu": "BDU:2024-01137", "desc": "Уязвимость в OpenSSL 3.0.0 до 3.0.13, 3.1.0 до 3.1.5, и 3.2.0 до 3.2.1.", "risk": "Средний"}, {"bdu": "BDU:2023-04959", "desc": "OpenSSL 3.1.0 до 3.1.2, и 3.0.0 до 3.0.10 содержит ошибку в реализации шифра AES-SIV.", "risk": "Средний"}, {"bdu": "BDU:2024-02846", "desc": "Реализация POLY1305 MAC содержит ошибку, которая может привести к повреждению внутреннего состояния приложений, запущенных\nна платформах на базе процессора PowerPC, если процессор предоставляет векторные инструкции.", "risk": "Средний"}, {"bdu": "BDU:2024-01337", "desc": "Уязвимость в OpenSSL 3.2.0 до 3.2.1, 3.1.0 до 3.1.5, 3.0.0 до 3.0.13, и 1.1.1 до 1.1.1x позволяет вызвать отказ в обслуживании приложений, которые загружают файлы в формате PKCS12 из ненадежных источников.", "risk": "Средний"}, {"bdu": "BDU:2023-05872", "desc": "Уязвимость в OpenSSL 3.1.0 до 3.1.3, 3.0.0 до 3.0.11, и 1.1.1 до 1.1.1w в POLY1305 MAC может привести к повреждению внутреннего состояния приложений при запуске на процессорах с поддержкой AVX512-IFMA инструкций.", "risk": "Средний"}, {"bdu": "BDU:2023-04957", "desc": "Уязвимость в OpenSSL 3.1.0 до 3.1.2, 3.0.0 до 3.0.10, и 1.1.1 до 1.1.1v может привести к отказу в обслуживании в функции DH_check().", "risk": "Средний"}, {"bdu": "BDU:2021-00873", "desc": "Атака Raccoon использует недостаток спецификации TLS, который может привести к тому, что злоумышленник сможет вычислить предварительный секрет в соединениях, использующих шифр Diffie-Hellman (DH) в основе шифрования. В этом случае злоумышленник сможет прослушивать все зашифрованные соединения, передаваемые по этому TLS соединению. Атака может быть использована только в том случае, если в реализации повторно используется DH-секрет для нескольких TLS-соединений. Обратите внимание, что эта проблема влияет только на наборы шифров DH, а не на наборы шифров ECDH. Эта проблема затрагивает только OpenSSL 1.0.2, которая вышла из-под поддержки и больше не получает публичных обновлений. Ошибка исправлена в OpenSSL 1.0.2w.", "risk": "Средний"}, {"bdu": "BDU:2023-03312", "desc": "Приложения, использующие при проверке сертификатов опции не по умолчанию, могут быть уязвимы для атаки со стороны вредоносного ЦС с целью обхода определенных проверок. Недействительные политики сертификата в листовых сертификатах молча игнорируются OpenSSL, и другие проверки политики сертификата для этого сертификата пропускаются. Вредоносный ЦС может использовать это для намеренного утверждения недействительных политик сертификата, чтобы полностью обойти проверку политики сертификата. Обработка политик отключена по умолчанию, но может быть включена путем передачи аргумента `-policy' утилитам командной строки или вызовом функции `X509_VERIFY_PARAM_set1_policies()'.", "risk": "Средний"}, {"bdu": "BDU:2024-08617", "desc": "Уязвимость в Python до 3.12.4, связана с tempfile.mkdtemp().", "risk": "Средний"}, {"bdu": "BDU:2021-03742", "desc": "Уязвимость в EVP_CipherUpdate, EVP_EncryptUpdate и EVP_DecryptUpdate в OpenSSL 1.1.1 до 1.1.1i, и 1.0.2 до 1.0.2x может привести к отказу в обслуживании.", "risk": "Средний"}, {"bdu": "BDU:2024-09600", "desc": "Уязвимость отказа в обслуживании виртуального жесткого диска Microsoft (VHDX)", "risk": "Средний"}, {"bdu": "BDU:2024-09610", "desc": "Уязвимость повышения привилегий в службе телефонии Windows", "risk": "Средний"}, {"bdu": "BDU:2024-09702", "desc": "Уязвимость повышения привилегий при кэшировании на стороне клиента Windows", "risk": "Средний"}, {"bdu": "BDU:2024-09701", "desc": "Уязвимость режима безопасного ядра Windows, приводящая к повышению привилегий", "risk": "Средний"}, {"bdu": "BDU:2024-09493", "desc": "Уязвимость Win32k, приводящая к повышению привилегий", "risk": "Средний"}, {"bdu": "BDU:2024-09592", "desc": "Уязвимость режима безопасного ядра Windows, приводящая к повышению привилегий", "risk": "Средний"}, {"bdu": "BDU:2024-09693", "desc": "Уязвимость реестра Windows, приводящая к повышению привилегий", "risk": "Средний"}, {"bdu": "BDU:2023-08615", "desc": "Генерация чрезмерно длинных ключей X9.42 DH или проверка чрезмерно длинных ключей или параметров X9.42 DH может выполняться очень медленно.", "risk": "Средний"}, {"bdu": "BDU:2024-09376", "desc": "Уязвимость повышения привилегий в планировщике задач Windows", "risk": "Средний"}, {"bdu": "BDU:2021-01844", "desc": "OpenSSL TLS-сервер может выйти из строя, если клиент отправит вредоносное сообщение ClientHello повторного согласования. Если ClientHello повторного согласования TLSv1.2 не содержит расширение signature_algorithms (где оно присутствовало в исходном ClientHello), но включает расширение signature_algorithms_cert, то произойдет разыменование указателя NULL, что приведет к сбою и атаке типа «отказ в обслуживании». Сервер уязвим только в том случае, если на нем включены TLSv1.2 и повторное согласование (что является конфигурацией по умолчанию). Клиенты OpenSSL TLS не подвержены этой проблеме. Все версии OpenSSL 1.1.1 подвержены этой проблеме. Пользователи этих версий должны обновиться до OpenSSL 1.1.1k. OpenSSL 1.0.2 не подвержен этой проблеме. Исправлено в OpenSSL 1.1.1k (затронуто 1.1.1-1.1.1j).", "risk": "Средний"}, {"bdu": "BDU:2021-03763", "desc": "Уязвимость в Python 3.9, 3.8, 3.7, и 3.6 (CVE-2021-23336)", "risk": "Средний"}, {"bdu": "BDU:2024-06735", "desc": "Приложения, выполняющие проверку имени сертификата (например, клиенты TLS, проверяющие сертификаты серверов), могут попытаться считать недопустимый адрес памяти, что приведет к нештатному завершению процесса приложения.", "risk": "Средний"}, {"bdu": "BDU:2023-03312", "desc": "Приложения, использующие нестандартную опцию при проверке сертификатов, могут быть уязвимы для атаки вредоносного CA с целью обойти определенные проверки. Недействительные политики сертификатов в листовых сертификатах молча игнорируются OpenSSL, а другие проверки политик сертификатов пропускаются для этого сертификата. Вредоносный CA может использовать это для преднамеренного утверждения недействительных политик сертификатов с целью полного обхода проверки политик сертификата. Обработка политик отключена по умолчанию, но ее можно включить, передав аргумент `-policy' утилитам командной строки или вызвав функцию `X509_VERIFY_PARAM_set1_policies()'.", "risk": "Средний"}, {"bdu": "BDU:2023-04980", "desc": "Уязвимость в Python 2.x по 2.7.18 и Python 3.x по 3.11 (CVE-2023-27043)", "risk": "Средний"}, {"bdu": "BDU:2024-04927", "desc": "В модуле CPython `zipfile` обнаружена проблема, затрагивающая версии 3.12.1, 3.11.7, 3.10.13, 3.9.18 и 3.8.18 и более ранние. Модуль zipfile уязвим для zip-бомб «quoted-overlap», которые используют формат zip для создания zip-бомбы с высокой степенью сжатия. Исправленные версии CPython заставляют модуль zipfile отклонять zip-архивы, которые перекрывают записи в архиве.", "risk": "Средний"}, {"bdu": "BDU:2021-01845", "desc": "Флаг X509_V_FLAG_X509_STRICT включает дополнительные проверки безопасности сертификатов, присутствующих в цепочке сертификатов. Он не установлен по умолчанию. Начиная с версии OpenSSL 1.1.1h, проверка для запрета сертификатов в цепочке, которые имеют явно закодированные параметры эллиптической кривой, была добавлена ​​как дополнительная строгая проверка. Ошибка в реализации этой проверки привела к тому, что результат предыдущей проверки для подтверждения того, что сертификаты в цепочке являются действительными сертификатами CA, был перезаписан. Это фактически обходит проверку того, что сертификаты, не являющиеся CA, не должны иметь возможности выдавать другие сертификаты. Если была настроена «цель», то есть последующая возможность для проверки того, что сертификат является действительным CA. Все именованные значения «цели», реализованные в libcrypto, выполняют эту проверку. Поэтому, если установлена ​​цель, цепочка сертификатов все равно будет отклонена, даже если использовался строгий флаг. Цель устанавливается по умолчанию в процедурах проверки сертификатов клиента и сервера libssl, но ее можно переопределить или удалить приложением. Чтобы быть затронутым, приложение должно явно установить флаг проверки X509_V_FLAG_X509_STRICT и либо не указывать цель проверки сертификата, либо, в случае клиентских или серверных приложений TLS, переопределить цель по умолчанию. OpenSSL версий 1.1.1h и более новых подвержены этой проблеме. Пользователи этих версий должны обновиться до OpenSSL 1.1.1k. OpenSSL 1.0.2 не подвержен этой проблеме. Исправлено в OpenSSL 1.1.1k (затронуто 1.1.1h-1.1.1j).", "risk": "Средний"}, {"bdu": "BDU:2024-08619", "desc": "Уязвимость в Python 3.10, 3.9, 3.8, and 3.7 (CVE-2022-26488)", "risk": "Средний"}, {"bdu": "BDU:2024-09590", "desc": "Уязвимость повышения привилегий в стеке обновлений Windows", "risk": "Средний"}, {"bdu": "BDU:2024-06863", "desc": "Существует уязвимость HIGH-критичности, влияющая на модуль CPython \"zipfile\", влияющий на \"zipfile.Path\". Обратите внимание, что более распространенный класс API \"zipfile.ZipFile\" не подвержен этой уязвимости. При итерации по именам записей в zip-архиве (например, методы \"zipfile.Path\", такие как \"namelist()\", \"iterdir()\" и т. д.) процесс может быть помещен в бесконечный цикл с вредоносным zip-архивом. Этот дефект применяется только при чтении метаданных или извлечении содержимого zip-архива. Программы, которые не обрабатывают управляемые пользователем zip-архивы, не подвержены этой уязвимости.", "risk": "Средний"}, {"bdu": "BDU:2024-06863", "desc": "Существует уязвимость HIGH-критичности, влияющая на модуль CPython \"zipfile\", влияющий на \"zipfile.Path\". Обратите внимание, что более распространенный класс API \"zipfile.ZipFile\" не подвержен этой уязвимости. При итерации по именам записей в zip-архиве (например, методы \"zipfile.Path\", такие как \"namelist()\", \"iterdir()\" и т. д.) процесс может быть помещен в бесконечный цикл с вредоносным zip-архивом. Этот дефект применяется только при чтении метаданных или извлечении содержимого zip-архива. Программы, которые не обрабатывают управляемые пользователем zip-архивы, не подвержены этой уязвимости.", "risk": "Средний"}, {"bdu": "BDU:2024-04109", "desc": "Некоторые конфигурации TLS-серверов, не установленные по умолчанию, могут приводить к неограниченному росту памяти при обработке сеансов TLSv1.3.", "risk": "Средний"}, {"bdu": "BDU:2021-00872", "desc": "Уязвимость отказа в обслуживании в функции GENERAL_NAME_cmp в OpenSSL 1.1.1 до 1.1.1h, и 1.0.2 до 1.0.2w.", "risk": "Средний"}, {"bdu": "BDU:2021-03744", "desc": "уязвимость разыменовывания нулевого указателя в функции X509_issuer_and_serial_hash() в OpenSSL 1.1.1 до 1.1.1i, и 1.0.2 до 1.0.2x может привести к отказу в обслуживании.", "risk": "Средний"}, {"bdu": "BDU:2023-04973", "desc": "Функция X509_VERIFY_PARAM_add0_policy() документирована для неявного включения проверки политики сертификата при проверке сертификата. Однако реализация функции не включает проверку, что позволяет сертификатам с недействительной или неправильной политикой пройти проверку сертификата. Поскольку внезапное включение проверки политики может нарушить существующие развертывания, было решено сохранить существующее поведение функции X509_VERIFY_PARAM_add0_policy(). Вместо этого приложениям, требующим от OpenSSL выполнения проверки политики сертификатов, необходимо использовать X509_VERIFY_PARAM_set1_policies() или явно включить проверку политики, вызвав X509_VERIFY_PARAM_set_flags() с аргументом флага X509_V_FLAG_POLICY_CHECK. Проверка политики сертификатов отключена по умолчанию в OpenSSL и не часто используется приложениями.", "risk": "Средний"}, {"bdu": "BDU:2023-04980", "desc": "Уязвимость в Python 2.x по 2.7.18 и Python 3.x по 3.11 в парсере e-mail адресов.", "risk": "Средний"}, {"bdu": "BDU:2024-09596", "desc": "Уязвимость ядра ОС Windows NT, приводящая к повышению привилегий", "risk": "Средний"}, {"bdu": "BDU:2024-09364", "desc": "Уязвимость повышения привилегий в библиотеке Windows DWM Core", "risk": "Средний"}, {"bdu": "BDU:2023-08026", "desc": "Уязвимость ввода команд в pip пакете pip до 23.3.", "risk": "Средний"}, {"bdu": "BDU:2022-05599", "desc": "В python обнаружена уязвимость. В алгоритмах с квадратичной временной сложностью, использующих недвоичные основания, при использовании int(\"text\") системе может потребоваться 50 мс для разбора строки int со 100 000 цифрами и 5 для 1 000 000 цифр (float, decimal, int.from_bytes() и int() для двоичных оснований 2, 4, 8, 16 и 32 не подвержены). Наибольшая угроза от этой уязвимости — доступность системы.", "risk": "Средний"}, {"bdu": "BDU:2024-08617", "desc": "Уязвимость в Python до 3.12.4, связана с tempfile.mkdtemp().", "risk": "Средний"}, {"bdu": "BDU:2024-09608", "desc": "Уязвимость раскрытия информации диспетчера библиотек пакетов Windows", "risk": "Средний"}, {"bdu": "BDU:2024-09605", "desc": "Уязвимость повышения привилегий Microsoft Windows VMSwitch", "risk": "Средний"}, {"bdu": "BDU:2024-09699", "desc": "Уязвимость отказа в обслуживании Windows Hyper-V", "risk": "Средний"}, {"bdu": "BDU:2024-09593", "desc": "Уязвимость повышения привилегий драйвера режима ядра Windows", "risk": "Средний"}, {"bdu": "BDU:2023-04973", "desc": "Функция X509_VERIFY_PARAM_add0_policy() документирована для неявного включения проверки политики сертификата при выполнении проверки сертификата. Однако реализация функции не включает проверку, что позволяет сертификатам с недействительными или неправильными политиками проходить проверку сертификата. Поскольку внезапное включение проверки политики может нарушить существующие развертывания, было решено сохранить существующее поведение функции X509_VERIFY_PARAM_add0_policy(). Вместо этого приложения, которым требуется OpenSSL для выполнения проверки политики сертификата, должны использовать X509_VERIFY_PARAM_set1_policies() или явно включить проверку политики, вызвав X509_VERIFY_PARAM_set_flags() с аргументом флага X509_V_FLAG_POLICY_CHECK. Проверки политики сертификата по умолчанию отключены в OpenSSL и обычно не используются приложениями.", "risk": "Средний"}, {"bdu": "BDU:2021-01720", "desc": "Уязвимость использования памяти после освобождения в bzip2recover в bzip2 1.0.6 позволяет удаленным злоумышленникам вызвать отказ в обслуживании (сбой) с помощью специально созданного файла bzip2, связанного с установкой концов блоков до начала блока.", "risk": "Средний"}, {"bdu": "BDU:2024-08617", "desc": "Уязвимость в Python до 3.12.4 (CVE-2024-4030)", "risk": "Средний"}, {"bdu": "BDU:2024-05196", "desc": "Модуль «ipaddress» содержал неверную информацию о том, были ли определенные адреса IPv4 и IPv6 обозначены как «глобально достижимые» или «частные». Это повлияло на свойства is_private и is_global классов ipaddress.IPv4Address, ipaddress.IPv4Network, ipaddress.IPv6Address и ipaddress.IPv6Network, где значения не возвращались в соответствии с последней информацией из реестров адресов специального назначения IANA. CPython 3.12.4 и 3.13.0a6 содержат обновленную информацию из этих реестров и, таким образом, имеют предполагаемое поведение.", "risk": "Низкий"}, {"bdu": "BDU:2021-03708", "desc": "В pydoc Python 3 есть уязвимость. Локальный или смежный злоумышленник, который обнаруживает или может убедить другого локального или смежного пользователя запустить сервер pydoc, может получить доступ к серверу и использовать его для раскрытия конфиденциальной информации, принадлежащей другому пользователю, к которой он обычно не может получить доступ. Наибольший риск этой уязвимости связан с конфиденциальностью данных. Эта уязвимость затрагивает версии Python до 3.8.9, версии Python до 3.9.3 и версии Python до 3.10.0a7.", "risk": "Низкий"}, {"bdu": "BDU:2024-05196", "desc": "Модуль «ipaddress» содержал неверную информацию о том, были ли определенные адреса IPv4 и IPv6 обозначены как «глобально достижимые» или «частные». Это повлияло на свойства is_private и is_global классов ipaddress.IPv4Address, ipaddress.IPv4Network, ipaddress.IPv6Address и ipaddress.IPv6Network, где значения не возвращались в соответствии с последней информацией из реестров адресов специального назначения IANA. CPython 3.12.4 и 3.13.0a6 содержат обновленную информацию из этих реестров и, таким образом, имеют предполагаемое поведение.", "risk": "Низкий"}]